backend-api/app/Controllers/API/HistoriBarang.php

SELECT *
FROM `barang`
WHERE `barang`.`id` = '8'
UPDATE `barang` SET `stok` = 10, `updated_at` = '2026-06-23 15:08:14'
WHERE `barang`.`id` IN ('8')
---
    public function create()
    {
        $data = $this->request->getJSON(true);
        $data['id_user'] = $this->request->user['id'];
        $data['tanggal'] = $data['tanggal'] ?? date('Y-m-d');

        // Cek barang ada atau tidak
        $barangModel = new BarangModel();
        $barang = $barangModel->find($data['id_barang']);

        if (!$barang) {
            return $this->failNotFound('Barang tidak ditemukan');
        }

        // Cek dan hitung stok baru
        if ($data['jenis'] == 'masuk') {
            $stokBaru = $barang['stok'] + $data['jumlah'];
        } else {
            if ($barang['stok'] < $data['jumlah']) {
                return $this->fail(['message' => 'Stok tidak mencukupi']);
            }
            $stokBaru = $barang['stok'] - $data['jumlah'];
        }

        // Update stok barang
        $barangModel->update($data['id_barang'], ['stok' => $stokBaru]);

SELECT *
FROM `barang`
WHERE `barang`.`id` = '8'
UPDATE `barang` SET `stok` = 20, `updated_at` = '2026-06-23 15:22:47'
WHERE `barang`.`id` IN ('8')
---
    public function update($id = null)
    {
        $data = $this->request->getJSON(true);

        $barangModel = new BarangModel();

        // Ambil histori lama dulu, sebelum diubah
        $historiLama = $this->model->find($id);

        if (!$historiLama) {
            return $this->failNotFound('Histori tidak ditemukan');
        }

        // Ambil data barang LAMA (sebelum diedit) untuk membalikkan efek lama
        $barangLama = $barangModel->find($historiLama['id_barang']);

        if (!$barangLama) {
            return $this->failNotFound('Barang tidak ditemukan');
        }

        // 1. Balikkan efek histori LAMA ke stok barang lama
        if ($historiLama['jenis'] == 'masuk') {
            $stokSetelahDibalikkan = $barangLama['stok'] - $historiLama['jumlah'];
        } else {
            $stokSetelahDibalikkan = $barangLama['stok'] + $historiLama['jumlah'];
        }
        $barangModel->update($historiLama['id_barang'], ['stok' => $stokSetelahDibalikkan]);

        // 2. Ambil data barang BARU (mungkin id_barang berubah saat edit, mungkin juga sama)
        $idBarangBaru = $data['id_barang'] ?? $historiLama['id_barang'];
        $barangBaru = $barangModel->find($idBarangBaru);

UPDATE `barang` SET `stok` = 9, `updated_at` = '2026-06-23 15:22:47'
WHERE `barang`.`id` IN ('8')
---
            }
            $stokBaru = $barangBaru['stok'] - $data['jumlah'];
        }
        $barangModel->update($idBarangBaru, ['stok' => $stokBaru]);

SELECT *
FROM `barang`
WHERE `barang`.`id` = '5'
UPDATE `barang` SET `stok` = 200, `updated_at` = '2026-06-23 08:25:37'
WHERE `barang`.`id` IN ('5')
---
    public function delete($id = null)
    {
        $barangModel = new BarangModel();

        // Ambil histori yang mau dihapus
        $histori = $this->model->find($id);

        if (!$histori) {
            return $this->failNotFound('Histori tidak ditemukan');
        }

        $barang = $barangModel->find($histori['id_barang']);

        if ($barang) {
            // Balikkan efek histori ke stok (kebalikan dari saat dibuat)
            if ($histori['jenis'] == 'masuk') {
                $stokBaru = $barang['stok'] - $histori['jumlah'];
            } else {
                $stokBaru = $barang['stok'] + $histori['jumlah'];
            }
            $barangModel->update($histori['id_barang'], ['stok' => $stokBaru]);